In [2]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

import math as m


account_df = pd.read_csv('../data/account.csv',sep=';')
card_df = pd.read_csv('../data/card_dev.csv', sep=';')
client_df = pd.read_csv('../data/client.csv',sep=';')
disp_df = pd.read_csv('../data/disp.csv',sep=';')
district_df = pd.read_csv('../data/district.csv',sep=';')
loan_df = pd.read_csv('../data/loan_dev.csv', sep=';')
trans_df = pd.read_csv("../data/trans_dev.csv",sep=";", low_memory=False)

# Process Client

In [3]:
client_df['sex'] = client_df['birth_number'].apply(lambda x : 0 if int(str(x)[2:4]) < 50 else 1)

# Process Account

In [4]:
month_frequency = [x for x in account_df['frequency'].unique()]
account_df['frequency'] = account_df['frequency'].apply(lambda x : month_frequency.index(x))

### Format Data

In [ ]:
account_df['date'] = pd.to_datetime(account_df['date'], format = '%y%m%d', errors='coerce');
account_df.head()

# Process Disp

In [5]:
type_frequency = [x for x in disp_df['type'].unique()]
disp_df['type'] = disp_df['type'].apply(lambda x : type_frequency.index(x))

# Process Card

In [6]:
type_frequency = [x for x in card_df['type'].unique()]
card_df['type'] = card_df['type'].apply(lambda x : type_frequency.index(x))

In [ ]:
card_df['issued'] = pd.to_datetime(card_df['issued'], format = '%y%m%d', errors='coerce');
card_df.head()

# Process District

### Change column types

In [ ]:
condition = district_df['no. of commited crimes 95'] != '?'
meanNoCommitedCrimes95 = int(pd.to_numeric(district_df['no. of commited crimes 95'][condition]).mean())

condition = district_df['no. of commited crimes 95'] == '?'
district_df.loc[district_df['no. of commited crimes 95'] == '?', 'no. of commited crimes 95'] = meanNoCommitedCrimes95 

district_df[["unemploymant rate 95"]] = district_df[["unemploymant rate 95"]].apply(pd.to_numeric, errors='coerce', axis=1)
district_df.dtypes

### Clean Column Names

In [ ]:
district_df.rename(columns = {'code ':'code', 'name ':'name', 
                            'no. of municipalities with inhabitants < 499 ': 'no of municipalities with inhabitants < 499',
                            'no. of municipalities with inhabitants 2000-9999 ': 'no. of municipalities with inhabitants 2000-9999', 
                            'no. of municipalities with inhabitants >10000 ': 'no. of municipalities with inhabitants >10000',
                            'no. of cities ':'no. of cities', 'ratio of urban inhabitants ':'ratio of urban inhabitants',
                            'average salary ':'average salary', "unemploymant rate '95 ": "unemploymant rate 95",
                            "unemploymant rate '96 ": "unemploymant rate 96 ", 
                            'no. of enterpreneurs per 1000 inhabitants ':'no. of enterpreneurs per 1000 inhabitants', 
                            "no. of commited crimes '95 ":"no. of commited crimes 95",
                           "no. of commited crimes '96 ": "no. of commited crimes 96"}, inplace = True)

district_df.head()

# Process Trans

### Clean Null values

In [ ]:
del trans_df['k_symbol']
del trans_df['bank']

trans_df.dtypes

In [ ]:
trans_df['date'] = pd.to_datetime(trans_df['date'], format = '%y%m%d', errors='coerce');
trans_df.head()

# Date Format

In [7]:
account_df['date'] = pd.to_datetime(account_df['date'], format = '%y%m%d', errors='coerce');
account_df.head()

   account_id  district_id  frequency       date
0         576           55          0 1993-01-01
1        3818           74          0 1993-01-01
2         704           55          0 1993-01-01
3        2378           16          0 1993-01-01
4        2632           24          0 1993-01-02

In [8]:
card_df['issued'] = pd.to_datetime(card_df['issued'], format = '%y%m%d', errors='coerce');
card_df.head()

   card_id  disp_id  type  issued       date
0     1005     9285     0  931107 1993-11-07
1      104      588     0  940119 1994-01-19
2      747     4915     0  940205 1994-02-05
3       70      439     0  940208 1994-02-08
4      577     3687     0  940215 1994-02-15

In [21]:
trans_df['date'] = pd.to_datetime(trans_df['date'], format = '%y%m%d', errors='coerce');
trans_df.head()

,trans_id,account_id,date,type,operation,amount,balance,k_symbol,bank,account
0,1548749,5270,1993-01-13,credit,credit in cash,800.0,800.0,NaN,NaN,NaN
1,1548750,5270,1993-01-14,credit,collection from another bank,44749.0,45549.0,NaN,IJ,80269753.0
2,3393738,11265,1993-01-14,credit,credit in cash,1000.0,1000.0,NaN,NaN,NaN
3,3122924,10364,1993-01-17,credit,credit in cash,1100.0,1100.0,NaN,NaN,NaN
4,1121963,3834,1993-01-19,credit,credit in cash,700.0,700.0,NaN,NaN,NaN